zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.h
typedef enum
{
    kBIAS_0_66V_LOW_POWER_MODE     = 0u, /**< This is intended to be used for retention mode of memory or digital */
    kBIAS_0_63V_HIGH_ACCURACY_MODE = 1u, /**< During active mode, the bias must be set in high accuracy mode */
    kBIAS_DISABLED                 = 2u, /**< Bias disabled */
    kBIAS_DISABLED2                = 3u  /**< Bias disabled */
} bias_pden_bias_t;

/**
 * @brief List of analog peripherals bits that can be powered on (see POWER_PeripheralPowerOn()) or off (see
 * POWER_PeripheralPowerOff()) in active mode
 */
typedef enum power_config_bit_s
{
    kPOWERCFG_DCDC    = (1UL << PMC_PDRUNCFG0_PDEN_DCDC_SHIFT),
    kPOWERCFG_BIAS    = (3UL << PMC_PDRUNCFG0_PDEN_BIAS_SHIFT), /* includes 0.66V/0.63V */
    kPOWERCFG_BOD1    = (1UL << PMC_PDRUNCFG0_PDEN_BOD1_SHIFT),
    kPOWERCFG_BOD2    = (1UL << PMC_PDRUNCFG0_PDEN_BOD2_SHIFT),
    kPOWERCFG_FRO192M = (1UL << PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT),
    kPOWERCFG_FRO1M   = (1UL << PMC_PDRUNCFG0_PDEN_FRO1M_SHIFT),
    kPOWERCFG_FRO32K  = (1UL << PMC_PDRUNCFG0_PDEN_FRO32K_SHIFT),
    kPOWERCFG_XTAL32K = (1UL << PMC_PDRUNCFG0_PDEN_XTAL32K_SHIFT),
    kPOWERCFG_BLE     = (1UL << PMC_PDRUNCFG0_PDEN_BLE_SHIFT),
    kPOWERCFG_RNG     = (1UL << PMC_PDRUNCFG0_PDEN_RNG_SHIFT)
} power_config_bit_t;

/**
 * @brief List of analog peripherals bits that can be excluded from being powered off when entering a low power mode.
 * The comment next to each item of the list specifies in which low power modes the peripheral can be excluded.
 * Note: (*) is always excluded for this power mode
 *
 * On DCDC_BYPASS:
 * VDD_IO needs to be supplied in the low power modes in order to enable the IO functionality (wakeup pin,
 * flexcom wakeup, reset, ...) The application needs to guarantee this supply by connecting the VDD_IO to the battery
 * directly or an external PMIC device. In case the VDD_IO is supplied by the output of the MCXW23x DC/DC converter,
 * the DC/DC convertor can't be switched off but must be put in bypass mode. Enabling the bypass switch will put the
 * DC/DC input level to the output minus the drop over the switch (typical xx mV). Enabling the bypass switch increased
 * also the leakage in power-off mode (see datasheet for typical value).
 *
 */
typedef enum low_power_config_bit_s
{
    kLOWPOWERCFG_DCDC = (1UL << PMC_PDSLEEPCFG0_PDEN_DCDC_SHIFT), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_BOD1 = (1UL << PMC_PDSLEEPCFG0_PDEN_BOD1_SHIFT), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_BOD2 = (1UL << PMC_PDSLEEPCFG0_PDEN_BOD2_SHIFT), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_FRO192M = (1UL << PMC_PDSLEEPCFG0_PDEN_FRO192M_SHIFT), /**< [DEEP SLEEP] */
    kLOWPOWERCFG_FRO32K =
        (1UL << PMC_PDSLEEPCFG0_PDEN_FRO32K_SHIFT), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_XTAL32K =
        (1UL << PMC_PDSLEEPCFG0_PDEN_XTAL32K_SHIFT),                /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_FRO1M = (1UL << PMC_PDSLEEPCFG0_PDEN_FRO1M_SHIFT), /**< [DEEP SLEEP,    POWER DOWN]                  */
    kLOWPOWERCFG_TRNG  = (1UL << PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT),   /**< [DEEP SLEEP,    POWER DOWN]               */
    kLOWPOWERCFG_DCDC_BYPASS =
        (1UL << (PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT + 1)), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_BLE_WUP =
        (1UL << (PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT + 2)), /**< [DEEP SLEEP,    POWER DOWN, DEEP POWER DOWN] */
    kLOWPOWERCFG_HFDSM = (1UL << (PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT + 3)) /**< [DEEP SLEEP] */
} low_power_config_bit_t;

/**
 * @brief List CPU retention configurations
 */
typedef enum cpu_retention_config_s
{
    kCPU_RETENTION_DISABLE = 0U,
    kCPU_RETENTION_ENABLE  = 1U
} cpu_retention_config_t;

#define kLOWPOWERCFG_DCDC_BYPASS_SHIFT (PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT + 1)

/**
 * @brief Defines of analog peripherals bits that can be excluded from being powered off grouped per low power mode.
 */
#define kEXCLUDE_FROM_PD_LIMITATION_MASK_DEEPSLEEP                                                                     \
    (kLOWPOWERCFG_DCDC | kLOWPOWERCFG_BOD1 | kLOWPOWERCFG_BOD2 | kLOWPOWERCFG_FRO192M | kLOWPOWERCFG_FRO32K |          \
     kLOWPOWERCFG_XTAL32K | kLOWPOWERCFG_FRO1M | kLOWPOWERCFG_TRNG | kLOWPOWERCFG_DCDC_BYPASS | kLOWPOWERCFG_BLE_WUP | \
     kLOWPOWERCFG_HFDSM)

#define kEXCLUDE_FROM_PD_LIMITATION_MASK_POWERDOWN                                                            \
    (kLOWPOWERCFG_DCDC | kLOWPOWERCFG_BOD1 | kLOWPOWERCFG_BOD2 | kLOWPOWERCFG_FRO32K | kLOWPOWERCFG_XTAL32K | \
     kLOWPOWERCFG_FRO1M | kLOWPOWERCFG_DCDC_BYPASS | kLOWPOWERCFG_BLE_WUP)

#define kEXCLUDE_FROM_PD_LIMITATION_MASK_DEEPPOWERDOWN                                                        \
    (kLOWPOWERCFG_DCDC | kLOWPOWERCFG_BOD1 | kLOWPOWERCFG_BOD2 | kLOWPOWERCFG_FRO32K | kLOWPOWERCFG_XTAL32K | \
     kLOWPOWERCFG_DCDC_BYPASS)

#define kEXCLUDE_FROM_PD_LIMITATION_MASK_POWEROFF (0U)

/**
 * @brief List of SRAM control bits.  Each bit represents an SRAM segment.
 */
typedef enum sram_ctrl_bit_s
{
    kSRAM_CTRL_RAMX0      = (1UL << 0U),
    kSRAM_CTRL_RAMX1      = (1UL << 1U),
    kSRAM_CTRL_RAMX2      = (1UL << 2U),
    kSRAM_CTRL_RAMX3      = (1UL << 3U),
    kSRAM_CTRL_RAM00      = (1UL << 4U),
    kSRAM_CTRL_RAM10      = (1UL << 5U),
    kSRAM_CTRL_RAM20      = (1UL << 6U),
    kSRAM_CTRL_RAMBLEDATA = (1UL << 7U),
    kSRAM_CTRL_RAMBLESEQL = (1UL << 8U)
} sram_ctrl_bit_t;

/**
 * @brief List of wakup IO control bits. Only used in deep power down and power off mode.
 */
typedef enum wakeup_io_bits_s
{
    kWAKEUP_PIN_ENABLE          = (1UL << PMC_WAKEUPIOCTRL_ENABLE_SHIFT),
    kWAKEUP_PIN_DISABLE         = (0UL << PMC_WAKEUPIOCTRL_ENABLE_SHIFT),
    kWAKEUP_PIN_PUP_EN          = (1UL << PMC_WAKEUPIOCTRL_PUP_EN_SHIFT),
    kWAKEUP_PIN_PUP_DIS         = (0UL << PMC_WAKEUPIOCTRL_PUP_EN_SHIFT),
    kWAKEUP_PIN_PDN_EN          = (1UL << PMC_WAKEUPIOCTRL_PDN_EN_SHIFT),
    kWAKEUP_PIN_PDN_DIS         = (0UL << PMC_WAKEUPIOCTRL_PDN_EN_SHIFT),
    kWAKEUP_PIN_WAKEUP_HIGH_LVL = (1UL << PMC_WAKEUPIOCTRL_LVL_SHIFT),
    kWAKEUP_PIN_WAKEUP_LOW_LVL  = (0UL << PMC_WAKEUPIOCTRL_LVL_SHIFT)
} wakeup_io_bits_t;

/**
 * @brief List of wake up interrupts to wake up from deep sleep, power down or deep power down. Note that any kind
 * of interrupt (also interrupts not listed here) can cause a wakeup from sleep mode.
 */
typedef enum wakeup_irq_s
{
    kWAKEUP_SYS                = (1ULL << WDT_BOD_IRQn),     /**< [DEEP SLEEP] (depends on syscon NMISRC config)*/
    kWAKEUP_DMA0               = (1ULL << DMA0_IRQn),        /**< [DEEP SLEEP] */
    kWAKEUP_GINT0              = (1ULL << GINT0_IRQn),       /**< [DEEP SLEEP, POWER DOWN] */
    kWAKEUP_PIN_INT0           = (1ULL << PIN_INT0_IRQn),    /**< [DEEP SLEEP] */
    kWAKEUP_PIN_INT1           = (1ULL << PIN_INT1_IRQn),    /**< [DEEP SLEEP] */
    kWAKEUP_PIN_INT2           = (1ULL << PIN_INT2_IRQn),    /**< [DEEP SLEEP] */
    kWAKEUP_PIN_INT3           = (1ULL << PIN_INT3_IRQn),    /**< [DEEP SLEEP] */
    kWAKEUP_UTICK              = (1ULL << UTICK0_IRQn),      /**< [DEEP SLEEP] */
    kWAKEUP_MRT                = (1ULL << MRT0_IRQn),        /**< [DEEP SLEEP] */
    kWAKEUP_CTIMER0            = (1ULL << CTIMER0_IRQn),     /**< [DEEP SLEEP] */
    kWAKEUP_CTIMER1            = (1ULL << CTIMER1_IRQn),     /**< [DEEP SLEEP] */
    kWAKEUP_SCT                = (1ULL << SCT0_IRQn),        /**< [DEEP SLEEP] */
    kWAKEUP_CTIMER3            = (1ULL << CTIMER3_IRQn),     /**< [DEEP SLEEP] */
    kWAKEUP_FLEXCOMM0          = (1ULL << FLEXCOMM0_IRQn),   /**< [DEEP SLEEP, POWER DOWN] */
    kWAKEUP_FLEXCOMM1          = (1ULL << FLEXCOMM1_IRQn),   /**< [DEEP SLEEP] */
    kWAKEUP_FLEXCOMM2          = (1ULL << FLEXCOMM2_IRQn),   /**< [DEEP SLEEP] */
    kWAKEUP_BLE_LL             = (1ULL << BLE_LL_IRQn),      /**< [DEEP SLEEP] */
    kWAKEUP_BLE_SLP_TMR        = (1ULL << BLE_SLP_TMR_IRQn), /**< [DEEP SLEEP, POWER DOWN]  */
    kWAKEUP_WDT                = (1ULL << WDT_IRQn),         /**< [DEEP SLEEP] (depends on syscon NMISRC config)*/
    kWAKEUP_BOD1               = (1ULL << BOD1_IRQn),        /**< [DEEP SLEEP] */
    kWAKEUP_BOD2               = (1ULL << BOD2_IRQn),        /**< [DEEP SLEEP] */
    kWAKEUP_RTC                = (1ULL << RTC_IRQn),         /**< [DEEP SLEEP, POWER DOWN, DEEP POWER DOWN] */
    kWAKEUP_WAKE_DSLP          = (1ULL << WAKE_DSLP_IRQn),   /**< [DEEP SLEEP] */
    kWAKEUP_PIN_INT4           = (1ULL << PIN_INT4_IRQn),    /**< [DEEP SLEEP] */
    kWAKEUP_PIN_INT5           = (1ULL << PIN_INT5_IRQn),    /**< [DEEP SLEEP] */
    kWAKEUP_PIN_INT6           = (1ULL << PIN_INT6_IRQn),    /**< [DEEP SLEEP] */
    kWAKEUP_PIN_INT7           = (1ULL << PIN_INT7_IRQn),    /**< [DEEP SLEEP] */
    kWAKEUP_CTIMER2            = (1ULL << CTIMER2_IRQn),     /**< [DEEP SLEEP] */
    kWAKEUP_CTIMER4            = (1ULL << CTIMER4_IRQn),     /**< [DEEP SLEEP] */
    kWAKEUP_OS_EVENT           = (1ULL << OS_EVENT_IRQn),    /**< [DEEP SLEEP, POWER DOWN, DEEP POWER DOWN] */
    kWAKEUP_SPIFI              = (1ULL << SPIFI_IRQn),       /**< [DEEP SLEEP] */
    kWAKEUP_SEC_GPIO_INT0_IRQ0 = (1ULL << SEC_GPIO_INT0_IRQ0_IRQn), /**< [DEEP SLEEP] */
    kWAKEUP_SEC_GPIO_INT0_IRQ1 = (1ULL << SEC_GPIO_INT0_IRQ1_IRQn), /**< [DEEP SLEEP] */
    kWAKEUP_PLU                = (1ULL << PLU_IRQn),                /**< [DEEP SLEEP] */
    kWAKEUP_SEC_VIO            = (1ULL << SEC_VIO_IRQn),            /**< [DEEP SLEEP] */
    kWAKEUP_TRNG               = (1ULL << TRNG_IRQn),               /**< [DEEP SLEEP] */
    kWAKEUP_DMA1               = (1ULL << DMA1_IRQn),               /**< [DEEP SLEEP] */
    kWAKEUP_WAKE_PAD           = (1ULL << 63U),                     /**< [DEEP POWER DOWN, POWER OFF] */
} wakeup_irq_t;

#ifdef __cplusplus
extern "C" {
#endif
/*******************************************************************************
 * API
 ******************************************************************************/

/*!
 * @brief Function to initialize the library.
 */
void POWER_Init(void);

/*!
 * @brief Function to reset device. This will result in a full boot cycle.
 */
void POWER_Reset(void);

/*!
 * @brief Function to return the library version.
 * @return version number of the power library
 */
uint32_t POWER_GetLibVersion(void);

/*!
 * @brief Function to disable the power of an analog peripheral when the device is in active mode.
 * @param powerConfigBit    peripheral for which to disable the power
 */
void POWER_PeripheralPowerOff(power_config_bit_t powerConfigBit);

/*!
 * @brief Function to enable the power of an analog peripheral when the device is in active mode.
 * @param powerConfigBit    peripheral for which to enable the power
 */
void POWER_PeripheralPowerOn(power_config_bit_t powerConfigBit);

/*!
 * @brief Function to power off certain SRAM segments.
 * @param sramCtrl    mask of sram_ctrl_bit_t bits to power off.
 */
void POWER_DisableSRAM(uint32_t sramCtrl);

/*!
 * @brief Function to power on certain SRAM segments. By default all SRAM segments are on.
 * @param sramCtrl    mask of sram_ctrl_bit_t bits to power on.
 */
void POWER_EnableSRAM(uint32_t sramCtrl);

/*!
 * @brief Function to return power status of all SRAM segments.
 * @return sram_ctrl_bit_t bits of enabled SRAM segments.
 */
uint32_t POWER_GetSRAMConfig(void);

/*!
 * @brief Function to configure the detection level of BOD1.
 * @param level      BOD1 detect level
 * @post             BOD1 is configured to kBOD_NO_ACTION
 * @post             this call must be followed by POWER_ConfigureBOD1() if reset or interrupt is required
 */
void POWER_SetBod1Level(bod_level_t level);

/*!
 * @brief Function to configure the detection level of BOD2.
 * @param level      BOD2 detect level
 * @post             BOD2 is configured to kBOD_NO_ACTION
 * @post             this call must be followed by POWER_ConfigureBOD2() if reset or interrupt is required
 */
void POWER_SetBod2Level(bod_level_t level);

/*!
 * @brief Function to configure the BOD1 action. Note that BOD is disabled automatically when BOD reset is triggered but
 * the settings remain.
 * @param action     the action to take when a BOD is detected
 * @note Set the desired threshold voltage using POWER_SetBod1Level() before enabling BOD interrupt or BOD reset.
 */
void POWER_ConfigureBOD1(bod_action_t action);

/*!
 * @brief Function to configure the BOD2 action. Note that BOD is disabled automatically when BOD reset is triggered but
 * the settings remain.
 * @param action     the action to take when a BOD is detected
 * @note Set the desired threshold voltage using POWER_SetBod2Level() before enabling BOD interrupt or BOD reset.
 */
void POWER_ConfigureBOD2(bod_action_t action);

/*!
 * @brief Function to clear the BOD1 interrupt. It does not
 *        clear the interrupt in the NVIC.
 */
void POWER_ClearBOD1Interrupt(void);

/*!
 * @brief Function to clear the BOD2 interrupt. It does not
 *        clear the interrupt in the NVIC.
 */
void POWER_ClearBOD2Interrupt(void);

/*!
 * @brief Function to retrieve the BOD1 status.
 * @return true as long as BOD1 detects a voltage below the threshold
 */
bool POWER_IsBOD1Active(void);

/*!
 * @brief Function to retrieve the BOD2 status.
 * @return true as long as BOD2 detects a voltage below the threshold
 */
bool POWER_IsBOD2Active(void);

/**
 * @brief Function to enter sleep: stop CPU, continues execution after wake up by any interrupt.
 */
void POWER_EnterSleep(void);

/**
 * @brief Function to enter deep sleep mode: stop CPU and power down flash, active srams put in retention, continues
 * execution after wakeup
 * @param excludeFromPd       mask of power domain peripheral bits to specify which not to power down during
 *                              the low power mode. See comments in low_power_config_bit_t to understand which values
 *                              are valid for this power mode.
 * @param wakeupInterrupts     mask of wake up interrupt bits (see wakeup_irq_t) to specify which interrupt sources can
 *                              cause a wake up from the low power mode. See comments in wakeup_irq_t to understand
 *                              which values are valid for this power mode.
 * @note If any interrupt that is used as wake up source is pending, the system will not go to the low power mode. To
 * avoid this, all interrupts that are configured as wakeupInterrupts will be briefly enabled in the NVIC so they can
 * be handled just before entering the low power mode. This means that the application must have an interrupt handler
 *       installed for every interrupt that is used as a wakeup source. Special care must be given to WDT, BOD1 and BOD2
 *       because they can be handled by the kWAKEUP_SYS interrupt or by their individual kWAKEUP_WDT, kWAKEUP_BOD1 or
 * kWAKEUP_BOD2 interrupt. Please make sure that if using e.g. kWAKEUP_WDT that a handler is installed for WDT_IRQn,
 * otherwise the default handler will be called when this interrupt is briefly enabled. This default handler will block
 * the system forever.
 * @retval kStatus_Success Successfully woken up from low power mode.
 * @retval kStatus_InvalidArgument Invalid argument(s), low power mode was never entered.
 *  Reasons why this function could return kStatus_InvalidArgument:
 *  @li Non existing low_power_config_bit_t value passed to excludeFromPd
 *  @li FRO32K or XTAL32K not enabled (not added to excludeFromPd), when BLE_WUP is exluded from pd (BLE can only
 * remain on, if it has a clock)
 *  @li FRO192M excluded from pd, but HFDSM not
 *  @li BOD Resets enabled (using POWER_ConfigureBOD1 and POWER_ConfigureBOD2) but BOD not powered (using
 * POWER_PeripheralPowerOn)
 *  @li utick timer clock enabled, while going to deep sleep, but HFDSM not added to exclude from pd list.
 *  @li FRO1M clock routed to ctimerX, while going to deep sleep, but HFDSM not added to exclude from pd list.
 */
status_t POWER_EnterDeepSleep(uint32_t excludeFromPd, uint64_t wakeupInterrupts);

/**
 * @brief Function to enter power down mode: power down flash and CPU, active srams put in retention, continues
 * execution after wakeup if CPU retention is enabled and resets after wake up if CPU retention is disabled.
 * interrupt
 * @param excludeFromPd       mask of power domain peripheral bits to specify which not to power down during
 *                              the low power mode. See comments in low_power_config_bit_t to understand which values
 *                              are valid for this power mode.
 * @param wakeupInterrupts     mask of wake up interrupt bits (see wakeup_irq_t) to specify which interrupt sources can
 *                              cause a wake up from the low power mode. See comments in wakeup_irq_t to understand
 *                              which values are valid for this power mode.
 * @param cpuRetentionCtrl    0 = CPU retention is disable / 1 = CPU retention is enabled, all other values are
 * RESERVED (see cpu_retention_config_t).
 * @note If any interrupt that is used as wake up source is pending, the system will not go to the low power mode. To
 * avoid this, all interrupts that are configured as wakeupInterrupts will be briefly enabled in the NVIC so they can
 * be handled just before entering the low power mode. This means that the application must have an interrupt handler
 *       installed for every interrupt that is used as a wakeup source.
 * @retval kStatus_Success Successfully woken up from low power mode if CPU retention was enabled. If CPU retention was
 * not enabled, function will never return because application reboot is expected.
 * @retval kStatus_InvalidArgument Invalid argument(s), low power mode was never entered.
 *  Reasons why this function could return kStatus_InvalidArgument:
 *  @li Non existing low_power_config_bit_t value passed to excludeFromPd
 *  @li FRO32K or XTAL32K not enabled (not added to excludeFromPd), when BLE_WUP is exluded from pd (BLE can only
 * remain on, if it has a clock)
 *  @li BOD Resets enabled (using POWER_ConfigureBOD1 and POWER_ConfigureBOD2) but BOD not powered (using
 * POWER_PeripheralPowerOn)
 *  @li Invalid wake up interrupt used for this power mode.
 */
status_t POWER_EnterPowerDown(uint32_t excludeFromPd, uint64_t wakeupInterrupts, uint32_t cpuRetentionCtrl);

/**
 * @brief Function to enter deep power down mode: power down almost whole chip, reset/wake up by pin, RTC or OS Timer
 * @param excludeFromPd       mask of power domain peripheral bits to specify which not to power down during
 *                              the low power mode. See comments in low_power_config_bit_t to understand which values
 *                              are valid for this power mode.
 * @param wakeupInterrupts     mask of wake up interrupt bits (see wakeup_irq_t) to specify which interrupt sources can
 *                              cause a wake up from the low power mode. See comments in wakeup_irq_t to understand
 *                              values are valid for this power mode.
 * @param wakeupIoCtrl        mask of wake up pin control bits (see wakeup_io_bits_t) to configure the wakeup pin.
 * @note If any interrupt that is used as wake up source is pending, the system will not go to the low power mode. To
 * avoid this, all interrupts that are configured as wakeupInterrupts will be briefly enabled in the NVIC so they can
 * be handled just before entering the low power mode. This means that the application must have an interrupt handler
 *       installed for every interrupt that is used as a wakeup source.
 * @retval kStatus_InvalidArgument Invalid argument(s), low power mode was never entered (in case of successful
 * execution, function will never return because application reboot is expected).
 *  Reasons why this function could return kStatus_InvalidArgument:
 *  @li Non existing low_power_config_bit_t value passed to excludeFromPd
 *  @li BOD Resets enabled (using POWER_ConfigureBOD1 and POWER_ConfigureBOD2) but BOD not powered (using
 * POWER_PeripheralPowerOn)
 *  @li Invalid wake up interrupt used for this power mode.
 */
status_t POWER_EnterDeepPowerDown(uint32_t excludeFromPd, uint64_t wakeupInterrupts, uint32_t wakeupIoCtrl);

/**
 * @brief Function to enter power off mode: power down almost whole chip, reset/wake up by pin only
 * @param excludeFromPd       mask of power domain peripheral bits to specify which not to power down during
 *                              the low power mode. See comments in low_power_config_bit_t to understand which values
 *                              are valid for this power mode.
 * @param wakeupIoCtrl        mask of wake up pin control bits (see wakeup_io_bits_t) to configure the wakeup pin.
 * @retval kStatus_InvalidArgument Invalid argument(s), low power mode was never entered (in case of successful
 * execution, function will never return because application reboot is expected).
 *  Reasons why this function could return kStatus_InvalidArgument:
 *  @li Non existing low_power_config_bit_t value passed to excludeFromPd
 */
status_t POWER_EnterPowerOff(uint32_t excludeFromPd, uint32_t wakeupIoCtrl);

/*!
 * @brief Function that returns the Supply Mode.
 * @return Supply Mode.
 */
dcdc_mode_t POWER_DCDC_GetSupplyMode(void);

/*!
 * @brief Function that sets the Supply mode
 * @retval kStatus_Success Successfully set the supply mode.
 * @retval kStatus_Power_SupplyModeModeInvalid The supply mode is not valid given the startup state of PMC (can be
 * retrieved using POWER_DCDC_GetSupplyMode).
 *       @li PMC reports kDCDC_MODE_HV_SM but chosen mode is kDCDC_MODE_LV_SM
 *       @li PMC reports kDCDC_MODE_LV_SM but chosen mode is kDCDC_MODE_HV_SM
 * @retval kStatus_Power_SupplyModeModeNotSupported The given supply mode is not supported on this silicon version (See
 * @ref SYSTEM_GetChipVersion).
 */
status_t POWER_DCDC_SetSupplyMode(dcdc_mode_t mode);

/*!
 * @brief Function to disable DC/DC convertor. When the device is using an external supply mode, the DC/DC convertor
 * should be disabled. When supply mode is kDCDC_MODE_HV_SM , the DCDC can't be disabled.
 */
void POWER_DCDC_Disable(void);

/*!
 * @brief Function to enable DC/DC convertor.
 */
void POWER_DCDC_Enable(void);

/*!
 * @brief Function to configure output level of DC/DC convertor when configured in buck mode.
 * @pre Can only be used supply mode kDCDC_MODE_HV_SM is used.
 * @param outputLvl    The output level of the DC/DC convertor.
 */
void POWER_DCDC_ConfigureBuckOutput(dcdc_buck_output_level_t outputLvl);

/*!
 * @brief Function to configure output level of DC/DC convertor when configured in boost mode.
 * @pre Can only be used supply mode kDCDC_MODE_LV_SM is used.
 * @param outputLvl    The output level of the DC/DC convertor.
 */
void POWER_DCDC_ConfigureBoostOutput(dcdc_boost_output_level_t outputLvl);

/*!
 * @brief Function to retrieve the time it took for the DC/DC to have stable output level. Note that the measurement
 * circuit saturates at 0xFFFF (65535 us). The times it takes for the DC/DC to stabilize the output can be used to fine
 * tune the BLE wake up timer. The BLE stack needs to enable 'correction' of the BLE wakeup timer based on how long it
 * takes for the DC/DC to stabilize.
 * @return value that indicates how long it took for DC/DC convertor to have a stable output in us.
 */
uint16_t POWER_DCDC_GetStartupDuration(void);

/*!
 * @brief Function to retrieve the reset cause.
 * @pre
 * @return reset cause register content when it was saved by bootloader - only significant bits
 */
reset_cause_t POWER_GetResetCause(void);

/*!
 * @brief Function to configure the caps of the 32KHz xtal
 * @param capIn The capIn setting
 * @param capOut The capOut setting
 */
void POWER_XTAL32K_ConfigureCaps(uint8_t capIn, uint8_t capOut);

