zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_power.h
/*!
 * @brief Function to configure the reference output current of the 32KHz xtal (reset value = 1)
 * @param gm The reference output current selection setting (0, 1, 2 or 3)
 */
void POWER_XTAL32K_ConfigureReferenceOutputCurrent(uint8_t gm);

/*!
 * @brief Function to configure the oscillator amplitude of the 32KHz xtal (reset value = 1)
 * @param ampl The oscillator amplitude setting (0, 1, 2 or 3)
 */
void POWER_XTAL32K_ConfigureOscillatorAmplitude(uint8_t ampl);

/*!
 * @brief Function to configure 32k xtal to bypass mode.  Caps will be set to 0 and XO32K block will be powered when
 * bypass is enabled.
 * @param enable True to put xtal in bypass mode, false otherwise
 */
void POWER_XTAL32K_EnableBypass(bool enable);

/*!
 * @brief Function to configure XTAL oscillator start up time.
 *        This function overrides the default start up time of 500 ms.
 * @param delay    delay time in ms
 */
void POWER_XTAL32K_SetStartupTime(uint32_t startupTime);

/*!
 * @brief Function to gate 32M BLE xtal
 * @param enable True to pass clock to BLE block, false otherwise
 */
void POWER_XTAL32M_BLE_GateEnable(bool enable);

/*!
 * @brief Function to configure 32MHz XTAL oscillator start up time.
 *        This function overrides the default start up time of 288 us.
 *        The resolution is 32 us. Only values from 1 until 15 are allowed (1=32us, 15=480us).
 * @param startupTime    startup time in steps of 32 us.
 * @retval kStatus_Success The startup time was successfully configured.
 * @retval kStatus_InvalidArgument The startup time was not between 1 and 15.
 */
status_t POWER_XTAL32M_SetStartupTime(uint8_t startupTime);

/**
 * Measure the voltage on Vbat_hv using BOD1.
 *
 * Normal operation of BOD1 is suspended during the conversion.
 * Voltage must remain stable during conversion in order to get accurate results
 * Note that WDT_BOD_IRQn is disabled during the measurement but is restored afterwards.
 *
 * @param voltage pointer to variable that'll hold the measured voltage in millivolts
 * @return kStatus_Success in case of success.
 */
status_t POWER_MeasureVoltageWithBod1(uint32_t *voltage);

/**
 * Measure the voltage on Vbat_hv using BOD2.
 *
 * Normal operation of BOD2 is suspended during the conversion.
 * Voltage must remain stable during conversion in order to get accurate results
 * Note that WDT_BOD_IRQn is disabled during the measurement but is restored afterwards.
 *
 * @param voltage pointer to variable that'll hold the measured voltage in millivolts
 * @return kStatus_Success in case of success.
 */
status_t POWER_MeasureVoltageWithBod2(uint32_t *voltage);

#ifdef __cplusplus
}
#endif

/**
 * @}
 */

#endif /* _FSL_POWER_H_ */
